smoke.yml
config:
  target: https://chan4lk.github.io
  # Load the Playwright engine:
  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: "./tests/home.spec.js"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
    - duration: 10
      arrivalRate: 2
      rampTo: 3
      name: Ramp up load
    # - duration: 30
    #   arrivalRate: 10
    #   rampTo: 30
    #   name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 3000
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - engine: playwright
    testFunction: "smokeTests"